//====================================================================
//  工学部「情報算法２」(富永)  例題
//  多倍長整数の計算  入出力と計算実行
//--------------------------------------------------------------------
//  BigNum  Test.c
//  ソース
//  Windows MinGW GCC 5.3.0
//--------------------------------------------------------------------
//  Marron Akanishi
//  2018.06.12  v1.0
//====================================================================


//====================================================================
//  前処理
//====================================================================

//--------------------------------------------------------------------
//  ヘッダ指定
//--------------------------------------------------------------------

#include <stdio.h>
#include <stdlib.h>
#include "BigNumLib.h"    // 多倍長整数ユーザ関数

#ifndef OPT
#define OPT 0
#endif

//====================================================================
//  大域宣言
//====================================================================

//--------------------------------------------------------------------
//  関数宣言
//--------------------------------------------------------------------


//====================================================================
//  本体処理
//====================================================================

int main(void) 
{
    //----  局所宣言
    BigNum n0;        // 加減乗算や累乗の結果変数
    BigNum n1, n2;    // 入力変数
    int e;            // 累乗の指数
    Bool flag;        // 結果の吟味
    int sw = OPT;

    //----  入力処理
    // 第1項の入力
    bignum_input(&n1);
    // 第2項の入力
    switch(sw){
        case 0:
        case 1:
        case 2:
            scanf("%d", &e);
            break;
        case 3:
        case 4:
            bignum_input(&n2);
            break;
        default:
            break;
    }
    bignum_output(n1);
    bignum_output(n2);

    //----  計算処理
    switch ( sw ) {
        case 0: 
            //puts("累乗(素朴法)");
            flag = bignum_pow1(n1, e, &n0);
            break;
        case 1:
            //puts("累乗(二乗法)");
            flag = bignum_pow2(n1, e, &n0);
            break;
        case 2:
            //puts("累乗(カラツバ法)");
            flag = bignum_pow3(n1, e, &n0);
            break;
        case 3:
            //puts("ブレンドの算法")
            flag = bignum_gcd1(n1, n2, &n0);
            break;
        case 4:
            //puts("ユークリッドの互除法")
            flag = bignum_gcd2(n1, n2, &n0);
            break;
    }

    //----  出力処理
    if(flag){
        bignum_output(n0);    // 整商の出力
    }else{
        puts("Error");
    }

    //----  終了処理
    return 0;
}

