//====================================================================
//  C言語 中級プログラミング  例題
//  高速整列算法
//--------------------------------------------------------------------
//  AlgoSort Test.c
//  ソース本体
//  Windows MinGW GCC 6.3.0
//--------------------------------------------------------------------
//  Marron Akanishi
//  2018.07.01
//====================================================================


//====================================================================
//  ヘッダ情報
//====================================================================

#include <stdio.h>
#include <stdlib.h>
#include "AlgoSortProc.h"


//====================================================================
//  メイン関数
//====================================================================

int main(void) 
{
  //----  宣言
  int mode;          // アルゴリズムモード
  int n;             // データ数
  Data seq[LEN];     // 元のデータ列
  int ct_cmp = 0;    // 比較回数
  int ct_swp = 0;    // 交換回数

  //----  配列の長さと各要素の入力
  scanf("%d", &mode);
  scanf("%d", &n);
  input_arr(seq, n);
  puts("");

  //----  整列算法
  switch(mode){
    case 0:
      quick_sort(seq, n, &ct_cmp, &ct_swp);
      break;
    case 1:
      merge_sort(seq, n, &ct_cmp, &ct_swp);
      break;
    case 2:
      heap_sort(seq, n ,&ct_cmp, &ct_swp);
      break;
    case 3:
      gnome_sort(seq, n ,&ct_cmp, &ct_swp);
      break;
    default:
      puts("Error");
      break;
  }

  //----  整列結果の出力
  puts("");
  printf("%d %d\n", ct_cmp, ct_swp);

  return 0;
}
