//====================================================================
//  C言語 中級プログラミング  例題
//  高速整列算法
//--------------------------------------------------------------------
//  AlgoSort AlgoSortView.c
//  ソース本体
//  Linux  GCC 4.4
//--------------------------------------------------------------------
//  富永研究室  tominaga 富永浩之
//  2015.06.16
//====================================================================


//====================================================================
//  ヘッダ情報
//====================================================================

#include <stdio.h>
#include <stdlib.h>
#include "AlgoSortProc.h"


//====================================================================
//  メイン関数
//====================================================================

int main(void) 
{
  //----  宣言
  int n;             // データ数
  Data seq[LEN];     // データ列
  int ct_cmp = 0;    // 比較回数
  int ct_swp = 0;    // 交換回数

  //----  配列の長さと各要素の入力
  printf("データ数 = ?  ");
  scanf("%d", &n);
  printf("配列要素 : ?  ");
  input_arr(seq, n);
  puts("");

  //----  初期表示
  puts("比較  交換 :  処理過程");
  proc_view(seq, n, ct_cmp, ct_swp);

  //----  整列算法
  quick_sort_it_st(seq, n);
  proc_view(seq, n, ct_cmp, ct_swp);
  
  //----  整列結果の出力
  puts("");
  printf("比較 %3d回  交換 %3d回\n", ct_cmp, ct_swp);
  return 0;
}
