//====================================================================
//  工学部「情報算法２」(富永)  例題
//  多倍長整数の計算  入出力と計算実行
//--------------------------------------------------------------------
//  BigNum  BigNumMain.c
//  ソース
//  Linux  GCC 4.4
//--------------------------------------------------------------------
//  富永研究室  tominaga 富永浩之
//  2018.06.07  v2.0
//====================================================================


//====================================================================
//  仕様
//====================================================================

/*--------------------------------------------------------------------

多倍長整数を、4桁を1節とし、1万進数で実装する。
多倍長整数は、節数や桁数も保持した配列として、構造体で定義する。
四則演算は、ヘッダ BigNumLib.h を指定し、ライブラリ BigNumLib.c を利用する。

マクロ定数 _ope の値によって、コンパイルの結果が異なる
無定義のときは、2引数の演算(加算、減算、乗算、最大公約数)の入出力
_ope が 1 のときは、1引数の演算(累乗、累乗根)、
_ope が 2 のときは、除算で整商と剰余を出力
実際の計算は、コメント行の変更で
(ここもMakefileでマクロ定数で切り替えるようにしてもよい)

--------------------------------------------------------------------*/


//====================================================================
//  前処理
//====================================================================

//--------------------------------------------------------------------
//  ヘッダ指定
//--------------------------------------------------------------------

#include <stdio.h>
#include "BigNumLib.h"    // 多倍長整数ユーザ関数


//====================================================================
//  大域宣言
//====================================================================

//--------------------------------------------------------------------
//  関数宣言
//--------------------------------------------------------------------


//====================================================================
//  本体処理
//====================================================================

int main(void)
{
  //----  局所宣言
  BigNum n0;        // 加減乗算や累乗の結果変数
  BigNum n1, n2;    // 入力変数
  BigNum n3, n4;    // 除算における整商と剰余
  int e;            // 累乗の指数

  //----  開始処理
  puts("工学部「情報環境実験１」(富永) 2018年度 課題１");
  puts("多倍長整数の計算 4桁1節で1万進数による実装");
  puts("tominaga 富永浩之");       // 各自の学籍番号と氏名に修正
  puts("2018.06.05(火)  v3.0");    // 実際の更新日とバージョンを明記
  puts("");
  puts("多倍長整数の乗算");    // 実装の内容に合わせて修正(複数行でもよい)
  puts("入力は節数と4桁ごとの各節");
  puts("4 1 2345 67 0089 のように(1234500670089と解釈)");
  puts("");

  //----  入力処理
  printf("U1 N1[] = ? ??  "); bignum_input(&n1);    // 第1項の入力
#if _ope == 2 || _ope == 3
  printf("U2 N2[] = ? ??  "); bignum_input(&n2);    // 第2項の入力
#elif _ope == 0
  // printf("E = ?  "); scanf("%d", &e);    // 累乗の指数の入力
#endif

  //----  計算処理
  // bignum_add(n1, n2, &n0);    // 加算(2引数)
  // bignum_sub(n1, n2, &n0);    // 減算(2引数)
  bignum_mlt(n1, n2, &n0);    // 乗算(2引数)
  // n0 = n1; bignum_sq(&n0);    // 二乗(1引数)
  // bignum_pow(n1, e, &n0);    // 累乗(1引数、1指数)
  // bignum_div(n1, n2, &n3, &n4);    // 除算(2引数)
  // bignum_sqrt(n1, &n0);       // 平方根(1引数)
  // bignum_plrt(n1, e, &n0);    // 累乗根(1引数、1指数)
  // bignum_gcd(n1, n2, &n0);    // 最大公約数(2引数)

  //----  出力処理
#if _ope == 3
  printf("N3[] = "); bignum_output(n3);    // 整商の出力
  printf("N4[] = "); bignum_output(n4);    // 剰余の出力
#else
  printf("N0[] = "); bignum_output(n0);    // 結果の出力
#endif

  //----  終了処理
  return 0;
}

